# brew "newsboat"
brew "cloc"   # count lines of source code
brew "fzf"    # fuzzy finder
brew "git"    # the stupid content tracker
brew "mas"    # mac app store CLI
brew "mpv"    # video player
brew "neovim" # editor
brew "tmux"   # terminal multiplexer
brew "trash"  # move files to the trash
brew "tree"   # list files as tree

brew "fish"
brew "go"
cask "java"
# cask "mactex" # tex tools

# cask "gpg-suite-nightly"
# cask "calibre"
cask "alfred"
cask "betterzip"        # quick look compressed files
cask "dropbox"          # cloud storage for files
cask "flux"
cask "google-chrome"    # web-browser
cask "keka"             # compression/decompression tools
cask "paragon-ntfs"     # NTFS driver
cask "parallels11"
cask "protonvpn"
cask "skim"             # PDF viewer
cask "spotify"          # cloud audio player
cask "sublime-text-dev" # GUI editor
cask "telegram"         # messenger
cask "transmission"     # BitTorrent client

# Quick Look plugins
# https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen" # preview plain text files
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "suspicious-package"
cask "webpquicklook"

# tap "caskroom/fonts"
# cask "font-computer-modern"

mas "Bubble Translate", id: 986431962
mas "Tyme2", id: 1063996724
mas "PopClip", id: 445189367
